Revit 2027 API
MEPBuildingConstruction.GetConstructions Method
Gets all the Building Constructions corresponding to the specific Construction type.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<Construction> GetConstructions(
	ConstructionType constructionType
)
Public Function GetConstructions (
	constructionType As ConstructionType
) As ICollection(Of Construction)
public:
ICollection<Construction^>^ GetConstructions(
	ConstructionType constructionType
)
member GetConstructions :
        constructionType : ConstructionType -> ICollection<Construction>
Parameters
constructionType ConstructionType
The Construction Type of Building Construction.
Return Value
ICollection<Construction>
A collection containing Building constructions matching the construction type.
Remarks
This function is used to get the Building Construction of the Project Information.
See Also
Reference
MEPBuildingConstruction Class
Autodesk.Revit.DB.Mechanical Namespace